Функция SKUDlogPOST(Запрос)
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
	Параметры = ПрочитатьJSON(ЧтениеJSON, Истина);
	
	ИДустройства = Параметры["Device_ID"];
	ИДотпечатка = Параметры["Finger_ID"];
	
	Считыватель = Справочники.ДНЛ_СчитывателиОтпечатков.НайтиПоРеквизиту("Сканер_ID", ИДустройства);
	Если Считыватель.Пустая() Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		Ответ.УстановитьТелоИзСтроки("Неизвестное Устройство: " + ИДустройства);
		Ответ.Заголовки["Content-Type"] = "text/html; charset=utf-8";
		Возврат Ответ;
	КонецЕсли;
	
	ЗаписьОтпечаток = Считыватель.Отпечатки.Найти(ИДотпечатка, "Отпечаток_ID");
	Если ЗаписьОтпечаток = Неопределено Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		Ответ.УстановитьТелоИзСтроки("На Устройстве " + ИДустройства + " не найден отпечаток " + ИДотпечатка);
		Ответ.Заголовки["Content-Type"] = "text/html; charset=utf-8";
		Возврат Ответ;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Считыватель", Считыватель);
	ДопПараметры.Вставить("ОтпечатокИД", ИДотпечатка);
	ДопПараметры.Вставить("ОтпчатокТЧ", ЗаписьОтпечаток);
	ТекстОшибки = "";
	
	
	
	Если НЕ СоздатьЗаписьЖурналаСКУД(ДопПараметры, ТекстОшибки) Тогда
		
		Если ТекстОшибки = "" Тогда
			Ответ = Новый HTTPСервисОтвет(400);
			Ответ.УстановитьТелоИзСтроки("Не удалось создать запись в журнале СКУД.");
			Ответ.Заголовки["Content-Type"] = "text/html; charset=utf-8";
		Иначе
			Ответ = Новый HTTPСервисОтвет(400);
			Ответ.УстановитьТелоИзСтроки(ТекстОшибки);
			Ответ.Заголовки["Content-Type"] = "text/html; charset=utf-8";
		КонецЕсли;
		Возврат Ответ;
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("OK");
	Ответ.Заголовки["Content-Type"] = "text/html; charset=utf-8";
	
	Возврат Ответ;
	
КонецФункции

Функция SKUDdataPOST(Запрос)
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);
	Параметры = ПрочитатьJSON(ЧтениеJSON, Истина);
	
	ИДустройства = Параметры["Device_ID"];
	ИДотпечатка = Параметры["Finger_ID"];
	
	Считыватель = Справочники.ДНЛ_СчитывателиОтпечатков.НайтиПоРеквизиту("Сканер_ID", ИДустройства);
	Если Считыватель.Пустая() Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		Ответ.УстановитьТелоИзСтроки("Неизвестное Устройство: " + ИДустройства);
		Ответ.Заголовки["Content-Type"] = "text/html; charset=utf-8";
		Возврат Ответ;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Считыватель", Считыватель);
	ДопПараметры.Вставить("ОтпечатокИД", ИДотпечатка);
	ТекстОшибки = "";
	
	Если НЕ ЗаписатьОтпечатокНаУстройстве(ДопПараметры, ТекстОшибки) Тогда
		
		Если ТекстОшибки = "" Тогда
			Ответ = Новый HTTPСервисОтвет(400);
			Ответ.УстановитьТелоИзСтроки("Не удалось создать запись для отпечатка");
			Ответ.Заголовки["Content-Type"] = "text/html; charset=utf-8";
		Иначе
			Ответ = Новый HTTPСервисОтвет(400);
			Ответ.УстановитьТелоИзСтроки(ТекстОшибки);
			Ответ.Заголовки["Content-Type"] = "text/html; charset=utf-8";
		КонецЕсли;
		Возврат Ответ;
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("OK");
	Ответ.Заголовки["Content-Type"] = "text/html; charset=utf-8";
	
	Возврат Ответ;
	
	
КонецФункции

Функция СоздатьЗаписьЖурналаСКУД(ДопПараметры, ТекстОшибки)
	
	НоваяЗапись = РегистрыСведений.ДНЛ_ЖурналКонтроляДоступа.СоздатьМенеджерЗаписи();
	
	НоваяЗапись.Считыватель = ДопПараметры.Считыватель;
	НоваяЗапись.Отпечаток = ДопПараметры.ИДотпечатка;
	НоваяЗапись.Пользователь = ДопПараметры.ОтпечатокТЧ.Пользователь;
	НоваяЗапись.ДатаСканирования = ТекущаяДата();
	НоваяЗапись.Комментарий = ДопПараметры.Считыватель.Комментарий;
	
	Попытка
		НоваяЗапись.Записать();
		
		Возврат Истина;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Ложь;
	
КонецФункции

Функция ЗаписатьОтпечатокНаУстройстве(ДопПараметры, ТекстОшибки)
	
	СчитывательО = ДопПараметры.Считыватель.ПолучитьОбъект();
	НоваяЗапись = СчитывательО.Отпечатки.Добавить();
	НоваяЗапись.Отпечаток_ID = ДопПараметры.ИДотпечатка;
	НоваяЗапись.Комментарий = "Добавлен " + ТекущаяДата() + " на устройстве " + СчитывательО.Сканер_ID;
	
	Попытка
		СчитывательО.Записать();
		
		Возврат Истина;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Ложь;
	
	
КонецФункции

Функция SKUDlogGet(Запрос)
	// Получение списка контрагентов сгруппированным по холдингам
	Если Запрос.ПараметрыЗапроса.Получить("inn") <> Неопределено Тогда
		ИНН = Запрос.ПараметрыЗапроса.Получить("inn");
	Иначе
		ИНН = "";
	КонецЕсли;
	
	Если ИНН <> "" Тогда
		ПокупательС = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ИНН, , );
		Если ПокупательС = Справочники.Контрагенты.ПустаяСсылка() Тогда
			Ответ = Новый HTTPСервисОтвет(204);
			Ответ.Заголовки["Content-Type"] = "application/json; charset=utf-8";
			Возврат Ответ;
			
		Иначе
			ПокупательО = ПокупательС.ПолучитьОбъект();
			ПартнерС = ПокупательО.Партнер;
			ПартнерО = ПартнерС.ПолучитьОбъект();
			СоглашениеС = ПокупательО.ДНЛ_ОсновноеСоглашениеСПокупателем;
			ВидЦен = СоглашениеС.ВидЦен;
			КонактыТ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПокупательО, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента, , );
			КонактыЕМ = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПокупательО, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента, , );
			КонактыЮА = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПокупательО, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента, , );
			КонактыФА = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПокупательО, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента, , );
		КонецЕсли;
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		//	ЗаписьJSON.ЗаписатьНачалоМассива();
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("name");
		ЗаписьJSON.ЗаписатьЗначение(ПартнерО.НаименованиеПолное);
		ЗаписьJSON.ЗаписатьИмяСвойства("guid");
		ЗаписьJSON.ЗаписатьЗначение(Строка(ПартнерС.УникальныйИдентификатор()));
		
		ЗаписьJSON.ЗаписатьИмяСвойства("contractor");
		ЗаписьJSON.ЗаписатьНачалоМассива();
		//Пока ВыборкаПоКонтрагентам.Следующий() Цикл
		
		//	ВыборкаДетальныеЗаписи =  ВыборкаПоКонтрагентам.Выбрать();
		//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("guid");
		ЗаписьJSON.ЗаписатьЗначение(Строка(ПокупательС.УникальныйИдентификатор()));
		ЗаписьJSON.ЗаписатьИмяСвойства("inn");
		ЗаписьJSON.ЗаписатьЗначение(ПокупательО.ИНН);
		ЗаписьJSON.ЗаписатьИмяСвойства("name");
		ЗаписьJSON.ЗаписатьЗначение(ПокупательО.НаименованиеПолное);
		
		ЗаписьJSON.ЗаписатьИмяСвойства("priceTypeGUID");
		Если НЕ СоглашениеС.Пустая() Тогда
			ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(СоглашениеС.УникальныйИдентификатор()));
		Иначе
			ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВидЦен.УникальныйИдентификатор()));
		КонецЕсли;
		ЗаписьJSON.ЗаписатьИмяСвойства("phone");
		ЗаписьJSON.ЗаписатьЗначение(КонактыТ);
		ЗаписьJSON.ЗаписатьИмяСвойства("email");
		ЗаписьJSON.ЗаписатьЗначение(КонактыЕМ);
		ЗаписьJSON.ЗаписатьИмяСвойства("legalAddress");
		ЗаписьJSON.ЗаписатьЗначение(КонактыЮА);
		ЗаписьJSON.ЗаписатьИмяСвойства("actualAddress");
		ЗаписьJSON.ЗаписатьЗначение(КонактыФА);
		
		ЗаписьJSON.ЗаписатьИмяСвойства("dnl_managers");
		ЗаписьJSON.ЗаписатьНачалоМассива();
		
		Если ПартнерО.ОсновнойМенеджер <> Справочники.Пользователи.ПустаяСсылка() Тогда
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			ЗаписьJSON.ЗаписатьИмяСвойства("Manager_main");
			ЗаписьJSON.ЗаписатьЗначение(ПартнерО.ОсновнойМенеджер.Наименование);
			ЗаписьJSON.ЗаписатьИмяСвойства("phone");
			ЗаписьJSON.ЗаписатьЗначение(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПартнерО.ОсновнойМенеджер, Справочники.ВидыКонтактнойИнформации.ТелефонПользователя, , ));
			ЗаписьJSON.ЗаписатьИмяСвойства("email");
			ЗаписьJSON.ЗаписатьЗначение(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПартнерО.ОсновнойМенеджер, Справочники.ВидыКонтактнойИнформации.EmailПользователя, , ));
			ЗаписьJSON.ЗаписатьКонецОбъекта();
		КонецЕсли;
		Если ПартнерО.ДНЛ_МенеджерАктивныхПродаж <> Справочники.Пользователи.ПустаяСсылка() Тогда
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			ЗаписьJSON.ЗаписатьИмяСвойства("Manager_active");
			ЗаписьJSON.ЗаписатьЗначение(ПартнерО.ДНЛ_МенеджерАктивныхПродаж.Наименование);
			ЗаписьJSON.ЗаписатьИмяСвойства("phone");
			ЗаписьJSON.ЗаписатьЗначение(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПартнерО.ДНЛ_МенеджерАктивныхПродаж, Справочники.ВидыКонтактнойИнформации.ТелефонПользователя, , ));
			ЗаписьJSON.ЗаписатьИмяСвойства("email");
			ЗаписьJSON.ЗаписатьЗначение(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПартнерО.ДНЛ_МенеджерАктивныхПродаж, Справочники.ВидыКонтактнойИнформации.EmailПользователя, , ));
			ЗаписьJSON.ЗаписатьКонецОбъекта();
		КонецЕсли;
		Если ПартнерО.ДНЛ_МенеджерПоРазвитию <> Справочники.Пользователи.ПустаяСсылка() Тогда
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			ЗаписьJSON.ЗаписатьИмяСвойства("Manager_developer");
			ЗаписьJSON.ЗаписатьЗначение(ПартнерО.ДНЛ_МенеджерПоРазвитию.Наименование);
			ЗаписьJSON.ЗаписатьИмяСвойства("phone");
			ЗаписьJSON.ЗаписатьЗначение(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПартнерО.ДНЛ_МенеджерПоРазвитию, Справочники.ВидыКонтактнойИнформации.ТелефонПользователя, , ));
			ЗаписьJSON.ЗаписатьИмяСвойства("email");
			ЗаписьJSON.ЗаписатьЗначение(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПартнерО.ДНЛ_МенеджерПоРазвитию, Справочники.ВидыКонтактнойИнформации.EmailПользователя, , ));
			ЗаписьJSON.ЗаписатьКонецОбъекта();
		КонецЕсли;
		Если ПартнерО.ДНЛ_МенеджерПоВедению <> Справочники.Пользователи.ПустаяСсылка() Тогда
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			ЗаписьJSON.ЗаписатьИмяСвойства("Manager_support");
			ЗаписьJSON.ЗаписатьЗначение(ПартнерО.ДНЛ_МенеджерПоВедению.Наименование);
			ЗаписьJSON.ЗаписатьИмяСвойства("phone");
			ЗаписьJSON.ЗаписатьЗначение(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПартнерО.ДНЛ_МенеджерПоВедению, Справочники.ВидыКонтактнойИнформации.ТелефонПользователя, , ));
			ЗаписьJSON.ЗаписатьИмяСвойства("email");
			ЗаписьJSON.ЗаписатьЗначение(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПартнерО.ДНЛ_МенеджерПоВедению, Справочники.ВидыКонтактнойИнформации.EmailПользователя, , ));
			ЗаписьJSON.ЗаписатьКонецОбъекта();
		КонецЕсли;
		
		//СтруктураКонтакты = Новый Структура;
		//СтруктураКонтакты.Вставить("contacts", ЛичныеДанные);
		//ЗаписьJSON.УстановитьСтроку();
		//ЗаписатьJSON(ЗаписьJSON,СтруктураКонтакты);
		ЗаписьJSON.ЗаписатьКонецМассива();
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		//	КонецЦикла;
		//	КонецЦикла;
		ЗаписьJSON.ЗаписатьКонецМассива();
		
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
		
		//	ЗаписьJSON.ЗаписатьКонецМассива();
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
		Ответ.Заголовки["Content-Type"] = "application/json; charset=utf-8";
		Возврат Ответ;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			//"ВЫБРАТЬ РАЗЛИЧНЫЕ
			//|	Партнеры.Ссылка КАК Партнер,
			//|	Контрагенты.Ссылка КАК Контрагент
			//|ИЗ
			//|	Справочник.Партнеры КАК Партнеры
			//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
			//|		ПО Партнеры.Ссылка = Контрагенты.Партнер
			//|			И НЕ Контрагенты.ИНН = """"
			//|ГДЕ
			//|	Партнеры.Клиент
			//|   И НЕ Партнеры.ПометкаУдаления
			//|   И НЕ Контрагенты.ПометкаУдаления
			//|   И ЕСТЬNULL(Контрагенты.Ссылка, 0) <> 0
			//|ИТОГИ ПО
			//|	Партнер,
			//|	Контрагент";
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Партнеры.Ссылка КАК Партнер,
			|	Контрагенты.Ссылка КАК Контрагент,
			|	Контрагенты.ДНЛ_ОсновноеСоглашениеСПокупателем КАК ДНЛ_ОсновноеСоглашениеСПокупателем
			|ПОМЕСТИТЬ ВТ_ПартнерыКонтрагенты
			|ИЗ
			|	Справочник.Партнеры КАК Партнеры
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
			|		ПО Партнеры.Ссылка = Контрагенты.Партнер
			|			И (НЕ Контрагенты.ИНН = """")
			|ГДЕ
			|	Партнеры.Клиент
			|	И НЕ Партнеры.ПометкаУдаления
			|	И НЕ Контрагенты.ПометкаУдаления
			|	И ЕСТЬNULL(Контрагенты.Ссылка, 0) <> 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ПартнерыКонтрагенты.Партнер КАК Партнер,
			|	ВТ_ПартнерыКонтрагенты.Контрагент КАК Контрагент,
			|	ЕСТЬNULL(СоглашенияСКлиентами.Соглашение, ЗНАЧЕНИЕ(Справочник.СоглашенияСКлиентами.ПустаяСсылка)) КАК ТиповоеСоглашение,
			|	ЕСТЬNULL(СоглашенияСКлиентами.ВидЦен, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) КАК ВидЦен,
			|	ЕСТЬNULL(КонтактнаяИнформацияТелефон.Представление, """") КАК Телефон,
			|	ЕСТЬNULL(КонтактнаяИнформацияEmail.Представление, """") КАК Email,
			|	ЕСТЬNULL(КонтактнаяИнформацияЮрАдрес.Представление, """") КАК ЮридическийАдрес,
			|	ЕСТЬNULL(КонтактнаяИнформацияФактАдрес.Представление, """") КАК ФактическийАдрес
			|ПОМЕСТИТЬ ВТ_ДанныеПартнерыКонтрагенты
			|ИЗ
			|	ВТ_ПартнерыКонтрагенты КАК ВТ_ПартнерыКонтрагенты
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
			|		ПО ВТ_ПартнерыКонтрагенты.ДНЛ_ОсновноеСоглашениеСПокупателем = СоглашенияСКлиентами.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформацияТелефон
			|		ПО ВТ_ПартнерыКонтрагенты.Контрагент = КонтактнаяИнформацияТелефон.Ссылка
			|			И (КонтактнаяИнформацияТелефон.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
			|			И (КонтактнаяИнформацияТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформацияEmail
			|		ПО ВТ_ПартнерыКонтрагенты.Контрагент = КонтактнаяИнформацияEmail.Ссылка
			|			И (КонтактнаяИнформацияEmail.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
			|			И (КонтактнаяИнформацияEmail.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailКонтрагента))
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформацияЮрАдрес
			|		ПО ВТ_ПартнерыКонтрагенты.Контрагент = КонтактнаяИнформацияЮрАдрес.Ссылка
			|			И (КонтактнаяИнформацияЮрАдрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
			|			И (КонтактнаяИнформацияЮрАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформацияФактАдрес
			|		ПО ВТ_ПартнерыКонтрагенты.Контрагент = КонтактнаяИнформацияФактАдрес.Ссылка
			|			И (КонтактнаяИнформацияФактАдрес.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
			|			И (КонтактнаяИнформацияФактАдрес.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресКонтрагента))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ДанныеПартнерыКонтрагенты.Партнер КАК Партнер,
			|	ВТ_ДанныеПартнерыКонтрагенты.Контрагент КАК Контрагент,
			|	ЕСТЬNULL(ВТ_ДанныеПартнерыКонтрагенты.ТиповоеСоглашение, ЗНАЧЕНИЕ(Справочник.СоглашенияСКлиентами.ПустаяСсылка)) КАК ТиповоеСоглашение,
			|	ЕСТЬNULL(ВТ_ДанныеПартнерыКонтрагенты.ВидЦен, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) КАК ВидЦен,
			|	ЕСТЬNULL(ВТ_ДанныеПартнерыКонтрагенты.Телефон, """") КАК Телефон,
			|	ЕСТЬNULL(ВТ_ДанныеПартнерыКонтрагенты.Email, """") КАК Email,
			|	ЕСТЬNULL(ВТ_ДанныеПартнерыКонтрагенты.ЮридическийАдрес, """") КАК ЮридическийАдрес,
			|	ЕСТЬNULL(ВТ_ДанныеПартнерыКонтрагенты.ФактическийАдрес, """") КАК ФактическийАдрес
			|ИЗ
			|	ВТ_ДанныеПартнерыКонтрагенты КАК ВТ_ДанныеПартнерыКонтрагенты
			|ИТОГИ ПО
			|	Партнер,
			|	Контрагент";
		
		
		РезультатЗапроса = Запрос.Выполнить();
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписьJSON.ЗаписатьНачалоМассива();
		
		ВыборкаПоПартнерам = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Партнер");
		Пока ВыборкаПоПартнерам.Следующий() Цикл
			
			ЗаписьJSON.ЗаписатьНачалоОбъекта();
			ЗаписьJSON.ЗаписатьИмяСвойства("name");
			ЗаписьJSON.ЗаписатьЗначение(ВыборкаПоПартнерам.Партнер.НаименованиеПолное);
			ЗаписьJSON.ЗаписатьИмяСвойства("guid");
			ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаПоПартнерам.Партнер.УникальныйИдентификатор()));
			
			ВыборкаПоКонтрагентам = ВыборкаПоПартнерам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Контрагент");
			Если ВыборкаПоКонтрагентам.Количество() > 0 Тогда
				ЗаписьJSON.ЗаписатьИмяСвойства("contractor");
				ЗаписьJSON.ЗаписатьНачалоМассива();
				Пока ВыборкаПоКонтрагентам.Следующий() Цикл
					
					ВыборкаДетальныеЗаписи = ВыборкаПоКонтрагентам.Выбрать();
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						ЗаписьJSON.ЗаписатьНачалоОбъекта();
						ЗаписьJSON.ЗаписатьИмяСвойства("guid");
						ЗаписьJSON.ЗаписатьЗначение(Строка(ВыборкаДетальныеЗаписи.Контрагент.УникальныйИдентификатор()));
						ЗаписьJSON.ЗаписатьИмяСвойства("inn");
						ЗаписьJSON.ЗаписатьЗначение(ВыборкаДетальныеЗаписи.Контрагент.ИНН);
						ЗаписьJSON.ЗаписатьИмяСвойства("name");
						ЗаписьJSON.ЗаписатьЗначение(ВыборкаДетальныеЗаписи.Контрагент.НаименованиеПолное);
						
						ЗаписьJSON.ЗаписатьИмяСвойства("priceTypeGUID");
						Если НЕ ВыборкаДетальныеЗаписи.ТиповоеСоглашение.Пустая() Тогда
							ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаДетальныеЗаписи.ТиповоеСоглашение.УникальныйИдентификатор()));
						Иначе
							ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаДетальныеЗаписи.ВидЦен.УникальныйИдентификатор()));
						КонецЕсли;
						ЗаписьJSON.ЗаписатьИмяСвойства("phone");
						ЗаписьJSON.ЗаписатьЗначение(ВыборкаДетальныеЗаписи.Телефон);
						ЗаписьJSON.ЗаписатьИмяСвойства("email");
						ЗаписьJSON.ЗаписатьЗначение(ВыборкаДетальныеЗаписи.Email);
						ЗаписьJSON.ЗаписатьИмяСвойства("legalAddress");
						ЗаписьJSON.ЗаписатьЗначение(ВыборкаДетальныеЗаписи.ЮридическийАдрес);
						ЗаписьJSON.ЗаписатьИмяСвойства("actualAddress");
						ЗаписьJSON.ЗаписатьЗначение(ВыборкаДетальныеЗаписи.ФактическийАдрес);
						
						ЗаписьJSON.ЗаписатьИмяСвойства("dnl_managers");
						ЗаписьJSON.ЗаписатьНачалоМассива();
						
						Если ВыборкаПоПартнерам.Партнер.ОсновнойМенеджер <> Справочники.Пользователи.ПустаяСсылка() Тогда
							ЗаписьJSON.ЗаписатьНачалоОбъекта();
							ЗаписьJSON.ЗаписатьИмяСвойства("Manager_main");
							ЗаписьJSON.ЗаписатьЗначение(ВыборкаПоПартнерам.Партнер.ОсновнойМенеджер.Наименование);
							ЗаписьJSON.ЗаписатьИмяСвойства("phone");
							ЗаписьJSON.ЗаписатьЗначение(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаПоПартнерам.Партнер.ОсновнойМенеджер, Справочники.ВидыКонтактнойИнформации.ТелефонПользователя, , ));
							ЗаписьJSON.ЗаписатьИмяСвойства("email");
							ЗаписьJSON.ЗаписатьЗначение(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаПоПартнерам.Партнер.ОсновнойМенеджер, Справочники.ВидыКонтактнойИнформации.EmailПользователя, , ));
							ЗаписьJSON.ЗаписатьКонецОбъекта();
						КонецЕсли;
						Если ВыборкаПоПартнерам.Партнер.ДНЛ_МенеджерАктивныхПродаж <> Справочники.Пользователи.ПустаяСсылка() Тогда
							ЗаписьJSON.ЗаписатьНачалоОбъекта();
							ЗаписьJSON.ЗаписатьИмяСвойства("Manager_active");
							ЗаписьJSON.ЗаписатьЗначение(ВыборкаПоПартнерам.Партнер.ДНЛ_МенеджерАктивныхПродаж.Наименование);
							ЗаписьJSON.ЗаписатьИмяСвойства("phone");
							ЗаписьJSON.ЗаписатьЗначение(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаПоПартнерам.Партнер.ДНЛ_МенеджерАктивныхПродаж, Справочники.ВидыКонтактнойИнформации.ТелефонПользователя, , ));
							ЗаписьJSON.ЗаписатьИмяСвойства("email");
							ЗаписьJSON.ЗаписатьЗначение(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаПоПартнерам.Партнер.ДНЛ_МенеджерАктивныхПродаж, Справочники.ВидыКонтактнойИнформации.EmailПользователя, , ));
							ЗаписьJSON.ЗаписатьКонецОбъекта();
						КонецЕсли;
						Если ВыборкаПоПартнерам.Партнер.ДНЛ_МенеджерПоРазвитию <> Справочники.Пользователи.ПустаяСсылка() Тогда
							ЗаписьJSON.ЗаписатьНачалоОбъекта();
							ЗаписьJSON.ЗаписатьИмяСвойства("Manager_developer");
							ЗаписьJSON.ЗаписатьЗначение(ВыборкаПоПартнерам.Партнер.ДНЛ_МенеджерПоРазвитию.Наименование);
							ЗаписьJSON.ЗаписатьИмяСвойства("phone");
							ЗаписьJSON.ЗаписатьЗначение(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаПоПартнерам.Партнер.ДНЛ_МенеджерПоРазвитию, Справочники.ВидыКонтактнойИнформации.ТелефонПользователя, , ));
							ЗаписьJSON.ЗаписатьИмяСвойства("email");
							ЗаписьJSON.ЗаписатьЗначение(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаПоПартнерам.Партнер.ДНЛ_МенеджерПоРазвитию, Справочники.ВидыКонтактнойИнформации.EmailПользователя, , ));
							ЗаписьJSON.ЗаписатьКонецОбъекта();
						КонецЕсли;
						Если ВыборкаПоПартнерам.Партнер.ДНЛ_МенеджерПоВедению <> Справочники.Пользователи.ПустаяСсылка() Тогда
							ЗаписьJSON.ЗаписатьНачалоОбъекта();
							ЗаписьJSON.ЗаписатьИмяСвойства("Manager_support");
							ЗаписьJSON.ЗаписатьЗначение(ВыборкаПоПартнерам.Партнер.ДНЛ_МенеджерПоВедению.Наименование);
							ЗаписьJSON.ЗаписатьИмяСвойства("phone");
							ЗаписьJSON.ЗаписатьЗначение(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаПоПартнерам.Партнер.ДНЛ_МенеджерПоВедению, Справочники.ВидыКонтактнойИнформации.ТелефонПользователя, , ));
							ЗаписьJSON.ЗаписатьИмяСвойства("email");
							ЗаписьJSON.ЗаписатьЗначение(УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаПоПартнерам.Партнер.ДНЛ_МенеджерПоВедению, Справочники.ВидыКонтактнойИнформации.EmailПользователя, , ));
							ЗаписьJSON.ЗаписатьКонецОбъекта();
						КонецЕсли;
						ЗаписьJSON.ЗаписатьКонецМассива();
						
						ЗаписьJSON.ЗаписатьКонецОбъекта();
					КонецЦикла;
				КонецЦикла;
				ЗаписьJSON.ЗаписатьКонецМассива();
				
			КонецЕсли;
			ЗаписьJSON.ЗаписатьКонецОбъекта();
			
		КонецЦикла;
		ЗаписьJSON.ЗаписатьКонецМассива();
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
		Ответ.Заголовки["Content-Type"] = "application/json; charset=utf-8";
		Возврат Ответ;
	КонецЕсли;
	
КонецФункции